Extensions/ИнтеграцияGreenApi/Enums/iga_СтатусыПодтвержденияШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_СтатусыПодтвержденияШаблонов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПроверке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаШаблона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приостановлен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_СтатусыПодтвержденияШаблонов/Ext/ManagerModule.bsl
Функция ПолучитьПеречислениеПоСтатусу(Статус) Экспорт
	
	Если Статус = "APPROVED" Тогда
		Возврат Перечисления.iga_СтатусыПодтвержденияШаблонов.Подтвержден;
	ИначеЕсли Статус = "PENDING" Тогда
		Возврат Перечисления.iga_СтатусыПодтвержденияШаблонов.НаПроверке;
	ИначеЕсли Статус = "FAILED" Тогда
		Возврат Перечисления.iga_СтатусыПодтвержденияШаблонов.ОшибкаШаблона;
	ИначеЕсли Статус = "REJECTED" Тогда
		Возврат Перечисления.iga_СтатусыПодтвержденияШаблонов.Отклонен;
	ИначеЕсли Статус = "PAUSED" Тогда
		Возврат Перечисления.iga_СтатусыПодтвержденияШаблонов.Приостановлен;
	КонецЕсли;

КонецФункции
